
# Tasks


# Task 1

# day = int(input('День рождения: '))
# month = int(input('Месяц рождения: '))
# year = int(input('Год рождения: '))

# summa = day  + month  + year
# print(summa)

#  Task 2

#  summa_za_obuchenie = 600
#  sale =  int(input('Введите скидку: '))

#  result = summa_za_obuchenie - (summa_za_obuchenie * sale / 100)
#  print('Оставшаяся сумма для платежа состовляет', int(resuаlt) = '$')


# Task 3

# from math import pi

# r = int(input('Введите радиус круга: '))
# area = pi * r**2
# dlina = 2 * pi * r 

# print('Площадъ круга состовляет', round(area, 2)), 
# ('\nДлина круга состовляет', round(dlina, 2))

'''
Дан список name_of_list в котором хранится строка.
 Разрежьте ее на две равные части (если длина строки нечетная, то длина первой части должна быть на один символ больше).
  Переставьте эти две части местами, при этом каждый символ должен являться 
отдельной строкой, результат запишите в новый список new_list и выведите на экран.
'''

name_of_list =['visualstudio']
a = len(name_of_list[0])
print(a)